# 演習3
[PC01, PC02] - [Server01, Server02] 間で通信ができるようにネットワークを構成してみましょう。ただし下記の要件があります。

・PC01, PC02はネットワーク172.16.0.0/24に所属しています。

・Server01, Server02はネットワーク192.168.0.0/24に所属してます。

・デフォルトルートに設定しているRouterがダウンしても継続して通信ができるように設定してください。

---

## 1. ネットワーク構成（固定）

### 1-1. 接続（※要件に合わせて表記修正）
- PC側（172.16.0.0/24）
  - PC01 ↔ sw1 Fa0/1
  - PC02 ↔ sw1 Fa0/2
  - sw1 ↔ rt3 Gi0/0/0
  - sw1 ↔ rt4 Gi0/0/0
- Server側（192.168.0.0/24）
  - Server01 ↔ sw2 Fa0/1
  - Server02 ↔ sw2 Fa0/2
  - sw2 ↔ rt3 Gi0/0/1
  - sw2 ↔ rt4 Gi0/0/1

> 重要：rt3/rt4 は **両方のLANに接続**されている必要がある（PC側とServer側それぞれにIFがある）

![alt text](image-5.png)

---

### 1-2. アドレス設計（修正版）
#### 物理IP（各ルータIFの実IP）
- rt3
  - Gi0/0/0（PC側）：`172.16.0.3/24`
  - Gi0/0/1（Server側）：`192.168.0.3/24`
- rt4
  - Gi0/0/0（PC側）：`172.16.0.4/24`
  - Gi0/0/1（Server側）：`192.168.0.4/24`

#### 仮想IP（HSRPのVirtual IP：端末のGWに設定するIP）
- PC側 仮想GW：`172.16.0.254`
- Server側 仮想GW：`192.168.0.254`

#### 端末
- PC01：`172.16.0.10/24`  GW：`172.16.0.254`
- PC02：`172.16.0.20/24`  GW：`172.16.0.254`
- Server01：`192.168.0.10/24`  GW：`192.168.0.254`
- Server02：`192.168.0.20/24`  GW：`192.168.0.254`

---

### 1-3. ゴール
- 通常時：PC01/PC02 ↔ Server01/Server02 が疎通（ping成功）
- 障害時：**Active側ルータをダウン**（電源OFF or IF shutdown）しても、数秒以内に疎通が復旧する

---

## 2. 端末（PC/Server）のIP設定（Packet Tracer）
操作：端末 → **Desktop** → **IP Configuration**

### 2-1. PC側（172.16.0.0/24）
**PC01**
- IP Address：`172.16.0.10`
- Subnet Mask：`255.255.255.0`
- Default Gateway：`172.16.0.254`

**PC02**
- IP Address：`172.16.0.20`
- Subnet Mask：`255.255.255.0`
- Default Gateway：`172.16.0.254`

### 2-2. Server側（192.168.0.0/24）
**Server01**
- IP Address：`192.168.0.10`
- Subnet Mask：`255.255.255.0`
- Default Gateway：`192.168.0.254`

**Server02**
- IP Address：`192.168.0.20`
- Subnet Mask：`255.255.255.0`
- Default Gateway：`192.168.0.254`

### 2-3. 端末側確認（必須）
各端末：Desktop → **Command Prompt**
```text
ipconfig
```

---

## 3. ルータのL3IF設定（rt3/rt4）
> 先に「実IP」を入れて **up/up** を確定させる。その後 HSRP を入れる。

---

### 3-1. rt3：IF設定
```ios
rt3> enable
rt3# configure terminal

! PC側
rt3(config)# interface gigabitEthernet 0/0/0
rt3(config-if)# ip address 172.16.0.3 255.255.255.0
rt3(config-if)# no shutdown

! Server側
rt3(config)# interface gigabitEthernet 0/0/1
rt3(config-if)# ip address 192.168.0.3 255.255.255.0
rt3(config-if)# no shutdown
rt3(config-if)# end
```

確認：
```ios
rt3# show ip interface brief
```

---

### 3-2. rt4：IF設定
```ios
rt4> enable
rt4# configure terminal

! PC側
rt4(config)# interface gigabitEthernet 0/0/0
rt4(config-if)# ip address 172.16.0.4 255.255.255.0
rt4(config-if)# no shutdown

! Server側
rt4(config)# interface gigabitEthernet 0/0/1
rt4(config-if)# ip address 192.168.0.4 255.255.255.0
rt4(config-if)# no shutdown
rt4(config-if)# end
```

確認：
```ios
rt4# show ip interface brief
```

---

## 4. HSRP設定（冗長デフォルトゲートウェイ）
> ここで **Virtual IP（.254）** を作る。  
> 例では **rt3 を Active（優先）**、rt4 を Standby にする。

### 4-1. rt3：HSRP（Active想定）
#### PC側（172.16.0.254）
```ios
rt3# configure terminal
rt3(config)# interface gigabitEthernet 0/0/0
rt3(config-if)# standby 10 ip 172.16.0.254
rt3(config-if)# standby 10 priority 110
rt3(config-if)# standby 10 preempt
```

#### Server側（192.168.0.254）
```ios
rt3(config)# interface gigabitEthernet 0/0/1
rt3(config-if)# standby 20 ip 192.168.0.254
rt3(config-if)# standby 20 priority 110
rt3(config-if)# standby 20 preempt
rt3(config-if)# end
```

---

### 4-2. rt4：HSRP（Standby想定）
#### PC側（172.16.0.254）
```ios
rt4# configure terminal
rt4(config)# interface gigabitEthernet 0/0/0
rt4(config-if)# standby 10 ip 172.16.0.254
rt4(config-if)# standby 10 priority 100
rt4(config-if)# standby 10 preempt
```

#### Server側（192.168.0.254）
```ios
rt4(config)# interface gigabitEthernet 0/0/1
rt4(config-if)# standby 20 ip 192.168.0.254
rt4(config-if)# standby 20 priority 100
rt4(config-if)# standby 20 preempt
rt4(config-if)# end
```

---

### 4-3. HSRP状態確認（必須）
```ios
rt3# show standby brief
rt4# show standby brief
```

期待イメージ：
- Group 10（PC側）：rt3 が Active、rt4 が Standby
- Group 20（Server側）：rt3 が Active、rt4 が Standby
- Virtual IP がそれぞれ `.254` になっている

---

## 5. ルーティング確認（この演習は静的ルート不要）
rt3/rt4 は両ネットワークに直結しているため、通常は **Connectedルート**だけで到達できる。

```ios
rt3# show ip route
rt4# show ip route
```

確認ポイント：
- `C 172.16.0.0/24` が Gi0/0/0 に直結
- `C 192.168.0.0/24` が Gi0/0/1 に直結

---

## 6. 疎通確認（ping）

### 6-1. 通常時（まずは疎通）
PC01（Command Prompt）：
```text
ping 192.168.0.10
ping 192.168.0.20
```

PC02（Command Prompt）：
```text
ping 192.168.0.10
ping 192.168.0.20
```

Server01（Command Prompt）：
```text
ping 172.16.0.10
ping 172.16.0.20
```

補足：
- 最初の1回目はARPで落ちることがあるので **2回実行して確認**

---

## 7. フェイルオーバー確認（要件の本丸）
### 7-1. Activeルータをダウンさせる（例：rt3を落とす）
方法A：電源OFF（Packet Tracerでrt3を停止）  
方法B：IF shutdown（どちらかのLAN側を落とすと分かりやすい）

例：PC側IFを落とす
```ios
rt3# configure terminal
rt3(config)# interface gigabitEthernet 0/0/0
rt3(config-if)# shutdown
rt3(config-if)# end
```

### 7-2. 切り替わり確認
```ios
rt4# show standby brief
```
- Group 10 が rt4: Active になっていること

### 7-3. 端末間 ping で通信継続を確認
PC01：
```text
ping 192.168.0.10
```

> 途中で数発落ちてもOK（切替時間）。その後復旧して連続で通れば要件達成。

### 7-4. 復旧（任意）
```ios
rt3# configure terminal
rt3(config)# interface gigabitEthernet 0/0/0
rt3(config-if)# no shutdown
rt3(config-if)# end
```

`preempt` を入れているので、rt3 が復帰すると優先度により Active に戻る。

---

## 8. 失敗時の切り分け（最短）
1. **端末のIP/GWが正しいか**（GWは必ず `.254`）
   - `ipconfig`
2. **ルータIFが up/up**
   - `show ip interface brief`
3. **HSRPが成立しているか（Active/Standby/Virtual IP）**
   - `show standby brief`
4. **端末 → 仮想GWへ ping**
   - PC01：`ping 172.16.0.254`
   - Server01：`ping 192.168.0.254`
5. **同一LAN内の疎通**（L2切り分け）
   - PC01 → PC02
   - Server01 → Server02

---