# ルーティング手順書

対象：Packet Tracer / Cisco IOS（Router / L3 Switch）

### 0. 前提・ルール（最初に必ず確認）

#### 前提

* 機器：rt01, rt02（Router想定。L3SWでも可）
* 接続：rt01 Gi0/0/0 ↔ rt02 Gi0/0/0
* ネットワーク：`172.31.0.0/24`

#### 構成図
![alt text](image-1.png)

#### ルール

* 以降、プロンプト表記は `Router#` を基本とする（機器名は環境により異なる）
* 物理IFのIP設定後は必ず **`no shutdown`** と **状態確認** を行う
* 設定後は必要に応じて **保存（copy run start）** を行う（PTでも習慣化）

---

## 手順1：L3 IF に IP を設定して up/up を確認する

### 目的

* 物理IF（例：Gi0/0/0）を **L3インターフェースとして有効化**し、IPアドレスを設定する
* `show ip interface brief` で **Status/Protocol が up/up** になることを確認する

---

### 1-1. 初期ダイアログをスキップ

```text
Would you like to enter the initial configuration dialog? [yes/no]: no
Press RETURN to get started!
```

---

### 1-2. 特権EXEC → グローバル設定モードへ

```ios
Router> enable
Router# configure terminal
```

---

### 1-3. 対象IFへ移動して IP 設定＋有効化

例：rt01 の GigabitEthernet0/0/0 に `172.31.0.1/24`

```ios
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 172.31.0.1 255.255.255.0
Router(config-if)# no shutdown
```

補足：

* `ip address`：L3IFにIP/サブネットマスクを付与
* `no shutdown`：管理状態（administrative）を up にする

---

### 1-4. 状態確認（必須）

```ios
Router# show ip interface brief
```

期待するゴール：

```text
GigabitEthernet0/0/0   172.31.0.1  YES manual  up  up
```

---

### 重要：`no shutdown` しても down/down のままになる理由と対処

#### A. 物理リンクが張れていない（最頻出）

`no shutdown` は「管理的に有効化」するだけ。
ケーブル未接続 / 相手側電源OFF / 相手側ポートshutdown だと **down/down** のまま。

典型ログ例：

```text
%LINK-3-UPDOWN: Interface GigabitEthernet0/0/0, changed state to down
```

**対処チェック（Packet Tracer）**

* ケーブルが正しいポートに刺さっているか（Gi0/0/0 ↔ Gi0/0/0）
* 相手側も `no shutdown` になっているか
* ケーブル種別が適切か（PTはAutoでもOK）

#### B. administratively down ではないか確認

`show ip int brief` がこうなら shutdown が原因：

```text
administratively down down
```

→ 対処：対象IFで `no shutdown`

#### C. 追加の確認コマンド（切り分け強化）

```ios
Router# show interfaces gigabitEthernet 0/0/0
Router# show running-config interface gigabitEthernet 0/0/0
```

見るポイント：

* `administratively down` → shutdown原因
* `line protocol is down` → 物理/相手側要因が濃厚
* IP設定（想定のアドレス/マスク）が入っているか

---

### 完了条件（手順1）

* `show ip interface brief` で対象IFが **up/up**
* IPが意図通り設定されている

---

## 手順2：rt02 を設定して rt01 → rt02 の疎通（ping）を確認する

### 目的

* rt02 Gi0/0/0 に `172.31.0.2/24` を設定
* rt01（`172.31.0.1/24`）→ rt02（`172.31.0.2/24`）へ `ping` が成功することを確認

---

### 2-1. 物理構成（前提）

* rt01 Gi0/0/0 ↔ rt02 Gi0/0/0 をケーブル接続
* 同一セグメント：`172.31.0.0/24`

ポイント：

* 同一サブネットの直結なので **ルーティング設定は不要**（直で届く）

---

### 2-2. rt02 初期ダイアログをスキップ

```text
Would you like to enter the initial configuration dialog? [yes/no]: no
Press RETURN to get started!
```

---

### 2-3. rt02 の Gi0/0/0 に IP 設定＋有効化

```ios
Router> enable
Router# configure terminal
Router(config)# interface gigabitEthernet 0/0/0
Router(config-if)# ip address 172.31.0.2 255.255.255.0
Router(config-if)# no shutdown
```

---

### 2-4. rt02 のインターフェース状態確認

```ios
Router# show ip interface brief
```

期待：

```text
GigabitEthernet0/0/0   172.31.0.2   YES manual   up   up
```

#### 補足：一瞬 down/down に見えることがある（PTあるある）

* `no shutdown` 直後や、相手側の状態反映前は down/down のまま出ることがある
* その後、以下のログが出て up へ遷移する

```text
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up
```

---

### 2-5. rt01 → rt02 疎通確認（ping）

rt01 で実行：

```ios
Router> enable
Router# ping 172.31.0.2
```

#### 1回目が `.!!!!`（80%）になる理由（正常）

```text
.!!!!
Success rate is 80 percent (4/5)
```

理由：

* 1発目はARP解決（相手IP→MAC取得）が入るため、最初のICMPが落ちることがある
* **よくある正常挙動**

#### 2回目以降は `!!!!!`（100%）が期待

```text
!!!!!
Success rate is 100 percent (5/5)
```

---

### 2-6. （推奨）ARP確認（理解用・切り分け用）

rt01で確認：

```ios
Router# show arp
```

* `172.31.0.2` のMACが載っていれば、L2疎通＋ARP解決はOK

---

### 2-7. （推奨）設定保存

```ios
Router# copy running-config startup-config
```

---

### 完了条件（手順2）

* rt02：`show ip int brief` で Gi0/0/0 が **up/up**
* rt01：`ping 172.31.0.2` が **成功**（2回目以降100%でOK）

---
